In [2]:
import pandas as pd

In [3]:
xlsfile= pd.ExcelFile('testexc.xlsx')

In [8]:
dframe=xlsfile.parse('Arkusz1',header=None)

In [9]:
dframe

                0       1         2       3
0  This is a test     NaN       NaN     NaN
1              22     3.0      45.0    12.0
2              34    11.0      65.0   232.0
3              51    12.0      75.0   123.0
4            5677   123.0    7547.0   423.0
5            2454  1243.0  345632.0  1255.0

In [12]:
dframe.columns.names()

TypeError: 'FrozenList' object is not callable

In [13]:
dframe.fillna('one')

                0     1       2     3
0  This is a test   one     one   one
1              22     3      45    12
2              34    11      65   232
3              51    12      75   123
4            5677   123    7547   423
5            2454  1243  345632  1255